let bit = {
  CMS: [{
    title: "Главный модуль",
    description: "Раздел предназначен для технических специалистов со знанием PHP и HTML. Раздел содержит сведения о технологиях и основных принципах, заложенных в систему Bitrix Framework, описание классов и функций модуля 'Главный модуль'.",
    link: "https://dev.1c-bitrix.ru/api_help/main/index.php",
    start: true,
    standart: true,
    mb: true,
    b: true,
    ant: true,
  },
  {
    title: "Сайты",
    description: "С нашим модулем Сайты 24 любой пользователь CMS Битрикс может самостоятельно, просто и быстро создать собственный сайт. Профессиональный, красивый и приносящий прибыль.",
    link: "https://dev.1c-bitrix.ru/learning/course/?COURSE_ID=34&LESSON_ID=11217&LESSON_PATH=3905.4753.11223.11217",
    start: true,
    standart: true,
    mb: true,
    b: true,
    ant: true,
  },
    {
      title: "Число сайтов",
      description: "Количество сайтов одного экземпляра",
      link: "https://dev.1c-bitrix.ru/support/forum/forum6/topic47908/",
      start: 2,
      standart: "&#8734;",
      mb: "&#8734;",
      b: "&#8734;",
      ant: "&#8734;",
    },
    {
      title: "Число страниц",
      description: "Колличество страниц для сайта",
      link: "https://dev.1c-bitrix.ru/support/forum/forum6/topic96153/",
      start: "&#8734;",
      standart: "&#8734;",
      mb: "&#8734;",
      b: "&#8734;",
      ant: "&#8734;",
    },
    {
      title: "Управление структурой",
      description: "Сайт в системе '1С-Битрикс: Управление сайтом' обладает логической и физической структурой.</br> Логическая структура показывает как сгруппированы страницы и разделы по смыслу.</br> Физическая структура показывает расположение файлов и папок на сервере. Управление структурой сайта включает в себя:</br> Инструмент Структура для работы из публичной части ;</br> Менеджер файлов для работы из административного раздела ;</br> Управление меню и цепочкой навигации; </br>Работу с медиабиблиотекой .",
      link: "https://dev.1c-bitrix.ru/api_help/fileman/index.php",
      start: true,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Информационные блоки",
      description: "Модуль Информационные блоки - мощный и в то же время гибкий механизм для хранения и выборки информации различными способами. API модуля состоит из нескольких высокоуровневых функций для выборки данных в публичном разделе сайта и набора классов с низкоуровневыми методами для более специализированной работы.",
      link: "https://dev.1c-bitrix.ru/api_help/iblock/index.php",
      start: true,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Highload-блоки",
      description: "Модуль Highload-блоки - это модуль для работы с данными в условиях высоких нагрузок. Каждый highload-блок - это быстрый справочник без поддержки иерархии и с ограниченной поддержкой свойств. Highload-блоки могут обращаться к базе данных в том числе и через HandlerSocket и работать с большими объёмами данных. Они хранят элементы в своих таблицах и используют свои индексы.",
      link: "https://dev.1c-bitrix.ru/api_help/hlblock/index.php",
      start: true,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Поиск",
      description: "Работа модуля поиска сводится к предварительному индексированию и последующей выдаче информации сайте по запросу пользователя. Индексирование заключается в сохранении времени изменения, модуля-владельца, кода элемента, языка, web-адреса, заголовка, текста и двух произвольных параметров индексируемого элемента, а так же списка кодов групп пользователей, которые имеют доступ на чтение (как минимум) к данному элементу. Поиск заключается в выдаче списка результатов, удовлетворяющих введенной строке запроса (обрабатывается с учётом языка запросов), а так же набору установленных ограничений (модуль-владелец, код элемента, сайт, два произвольных параметра).",
      link: "https://dev.1c-bitrix.ru/api_help/search/index.php",
      start: true,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Перевод",
      description: "Модуль Перевод предоставляет удобный интерфейс для поиска и перевода языковых сообщений и позволяет:</br>Просмотреть распределение языковых фраз по файлам системы;</br>Определить количество непереведенных фраз для каждого файла;</br>Перейти к переводу необходимых текстовых сообщений.",
      link: "https://dev.1c-bitrix.ru/api_help/translate/index.php",
      start: true,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Форумы и Блоги",
      description: "Публичная часть форума строится на высокоуровневых функциях и классах ядра форума.</br>Сеть блогов и форумов - надежный источник обратной связи от пользователей. Предоставьте посетителям своего сайта полноценную площадку для общения и обмена мнениями по различным вопросам.",
      link: "https://dev.1c-bitrix.ru/api_help/forum/index.php",
      start: false,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Фотогалерея 2.0",
      description: "Модуль «Фотогалерея 2.0» - это современный и удобный инструмент для создания и управления фотоальбомами у вас на сайте. Вы можете создавать галереи для небольших сайтов и крупных проектов. Загружайте фотографии, проводите голосование и добавляйте комментарии!",
      link: "https://dev.1c-bitrix.ru/support/forum/forum6/topic62852/",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Социальная сеть",
      description: "Модуль Социальная сеть предоставляет следующие возможности:</br>- создание персонального профайла пользователя с возможностью его редактирования;</br>- настройка прав на доступ к содержимому личной страницы;</br>- создание произвольного числа рабочих групп;</br>- настройка прав на доступ к группе и содержимому ее страницы;</br>- форумы, блоги, календари, фотогалереи и файлы сотрудников и рабочих групп;</br>- классификация и поиск групп.",
      link: "https://dev.1c-bitrix.ru/api_help/socialnetwork/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Обучение, тестирование",
      description: "Создавайте дистанционные обучающие курсы для сотрудников или партнеров, контролируйте их прохождение и результаты с помощью удобного инструмента. Легко организуйте учебный процесс независимо от времени и места проведения занятий.",
      link: "https://dev.1c-bitrix.ru/api_help/learning/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Веб-мессенджер",
      description: "Как инструмент номер один, Веб-мессенджер дополняет привычные способы общения - телефон и электронную почту.</br>Интерактивный инструмент – Веб-мессенджер позволяет эффективно общаться и получать информацию прямо через браузер:</br>Пользователи портала общаются посредством мгновенных персональных сообщений (как в интернет-мессенджерах);</br>Список контактов формируется согласно структуре компании;</br>Центр нотификации выводит информацию о новых событиях на портале;</br>Индицируется присутствие сотрудника на портале (онлайн);</br>Присутствующие на портале сотрудники ведут «живой» диалог;</br>Уведомления о новых сообщениях появляются на любой странице портала;</br>Не работающим в текущий момент на портале пользователям сообщения доставляются позже;</br>Ведется архив сообщений диалогов пользователей;</br>Просмотреть личную переписку сотрудник также может из профиля другого пользователя («Показать переписку»).</br>Использование Веб-мессенджера отменяет необходимость установки в компании XMPP серверов и специальных Jabber клиентов. Реализован мессенджер с использованием всех инноваций современных браузеров (используется HTML5, local storage и т.д.).",
      link: "https://dev.1c-bitrix.ru/api_help/im/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Бизнес-процессы",
      description: "Модуль Бизнес-процессы предназначен для автоматизации бизнес-процессов организации, управления всеми этапами процесса и необходимыми для его исполнения действиями.</br>Модуль входит в состав редакции Энтерпрайз и Бизнес продукта '1С-Битрикс: Управление сайтом'.</br>Примечание: ограничения распространяются только на новые процессы, которые работают с живой лентой (прежние Бизнес-процессы в CRM, списках (только для тарифа Компания), документах не меняются, для них нет ограничений).",
      link: "https://dev.1c-bitrix.ru/api_help/bizproc/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Почта",
      description: "Корпоративная почта позволяет сохранить переписку с клиентом даже при уходе сотрудников. Почта хранится внутри компании – вы всегда сможете продолжить общение с клиентом с этого же адреса.<Реализуйте с помощью почтовых уведомлений четкую координацию работы сотрудников с пользователями вашего интернет-проекта и между собой. Система ведет журнал работы почтового модуля и сохраняет информацию обо всех событиях.</br>Защита от спама и неограниченная вместимость хранилища сделают работу быстрее и безопаснее.</br>Создавайте для компании неограниченное количество почтовых ящиков.</br>Получайте новые входящие сообщения мгновенно, благодаря гибким настройкам регулярного сканирования.</br>Не перегружайте сайт – установите лимит на количество сообщений, принимаемых с сервера за один сеанс соединения. Оставшиеся сообщения будут приняты в ходе следующего подключения.",
      link: "https://dev.1c-bitrix.ru/api_help/mail/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Техподдержка",
      description: "Организуйте на своем сайте качественный сервис поддержки – принимайте вопросы клиентов, настраивайте права доступа, статусы обращений и получайте подробные отчеты о работе службы.",
      link: "https://dev.1c-bitrix.ru/api_help/support/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Календари",
      description: "Календарь событий - прекрасный инструмент для планирования дел и мероприятий. Календарь помогает участникам событий согласовывать свои действия, а благодаря удобному интерфейсу и расширенному функционалу управлять намеченными делами легко и удобно.",
      link: "https://dev.1c-bitrix.ru/api_help/calendar/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Документооборот",
      description: "Контролируйте работу с файлами на своем сайте от создания до момента публикации. Модуль Документооборот помогает организовать и упорядочить редактирование новостей, статей и других материалов интернет-ресурса. Удобный и надежный инструмент фиксирует всю историю изменений, оптимизируя работу с документами.",
      link: "https://dev.1c-bitrix.ru/api_help/workflow/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "AD/LDAP интеграция",
      description: "«Active Directory/LDAP Интегратор» предназначен для интеграции «1C-Битрикс: Управление сайтом» в корпоративную сеть и централизации управления группами пользователей корпоративной информационной системы. Модуль входит только в редакцию «Энтерпрайз».",
      link: "https://dev.1c-bitrix.ru/api_help/ldap/index.php",
      start: false,
      standart: false,
      mb: false,
      b: false,
      ant: true,
    },
    {
      title: "Универсальные списки",
      description: "Модуль упрощает представление на сайте любой структурированной информации в виде списков: справочники, списки контактов, реестры, архивы и другие файловые хранилища. Вы можете править свои списки прямо из публичной части интерфейса, не заходя в административную панель.",
      link: "https://dev.1c-bitrix.ru/support/forum/forum23/topic107271/",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "База знаний Wiki",
      description: "Модуль предназначен для реализации функционала Wikipedia (коллективной работы над контентом страницы).",
      link: "https://dev.1c-bitrix.ru/api_help/wiki/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Сервис «Есть идея!»",
      description: "Мнение клиентов о товаре, услугах или работе сайта - незаменимый источник идей для развития бизнеса. Сервис «Есть идея!» даст возможность совершенствовать ваш ресурс, ориентируясь на мнение самих пользователей.",
      link: "https://dev.1c-bitrix.ru/api_help/socialservices/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Контроллер сайтов",
      description: "Контроллер сайтов предназначен для централизованного управления любым количеством независимых сайтов, созданных на платформе «1С-Битрикс: Управление сайтом».",
      link: "https://dev.1c-bitrix.ru/api_help/controller/index.php",
      start: false,
      standart: false,
      mb: false,
      b: false,
      ant: true,
    },
    //-------------------------------------------
    //-------------------------------------------
    {
      title: "Торговый каталог",
      description: "Важнейшая часть интернет-магазина - удобный и понятный каталог товаров, в котором легко ориентироваться. Чем легче вашему клиенту найти нужный товар - тем выше продажи. Настройте категории и фильтры каталога, чтобы сделать поиск быстрее. Формируя комплекты, помогите клиенту подобрать дополнительную вещь к уже приобретенной.",
      link: "https://dev.1c-bitrix.ru/api_help/catalog/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Функционал подарков",
      description: "Функционал подарков доступен, начиная с версии 16.0.0 модуля Интернет-магазин, и реализован с помощью правил работы с корзиной.</br>'Подарок' в системе '1С-Битрикс: Управление сайтом' – это товар, который выводится в специальном блоке, а при добавлении в корзину отображается как товар со скидкой 100%.",
      link: "https://dev.1c-bitrix.ru/learning/course/index.php?COURSE_ID=42&LESSON_ID=7571",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Интеграция с CRM",
      description: "CRM - это удобный инструмент для управления всеми взаимоотношениями с клиентами. Отправляйте в CRM всю информацию о клиентах, собранную на сайте – и работайте с единой клиентской базой, конвертируйте каждый заказ в продажу и проводите точные персонализированные рекламные кампании.",
      link: "https://dev.1c-bitrix.ru/api_help/crm/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Мастер управления магазином",
      description: "Мастер управления магазином в административной части интернет-магазина помогает владельцу правильно настроить и быстро запустить интернет-магазин. Мастер пошагово ведет владельца магазина вплоть до самого запуска. Готовность магазина в процентах отображается на визуальной панели.",
      link: "https://dev.1c-bitrix.ru/community/blogs/product_features/master-control-store-get-100-return.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Складской учет",
      description: "Интернет-магазин на платформе «1С-Битрикс: Управление сайтом» позволяет вести складской количественный учет. Для ведения склада и формирования минимального набора документов вам не нужно приобретать дополнительные программы.",
      link: "https://dev.1c-bitrix.ru/support/forum/forum26/topic137566/",
      start: false,
      standart: false,
      mb: 1,
      b: "&#8734;",
      ant: "&#8734;",
    },
    {
      title: "Валюты",
      description: "Модуль необходим для работы торгового каталога, интернет-магазина и статистики. Он позволяет управлять валютами и их курсами. Вы можете настроить курсы, подгружая новые прямо с сайта Центрального Банка РФ, определить номинал, для которого устанавливается обменный курс и установить курс валюты по умолчанию.",
      link: "https://dev.1c-bitrix.ru/api_help/currency/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Конструктор отчетов",
      description: "С помощью модуля можно создавать отчеты для разных объектов и в дальнейшем многократно их запускать. Отчеты изменяются в реальном времени, в зависимости от хода выполнения задач.",
      link: "https://dev.1c-bitrix.ru/api_help/report/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Разделение заказов между филиалами компании",
      description: "",
      link: "#",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },

    //----------------------------------------------------
    //----------------------------------------------------

    {
      title: "Техподдержка",
      description: "Современный корпоративный портал насыщен разнообразными функциями, сориентироваться в которых сотрудникам компании бывает порой непросто. Кроме того, многие производственные компании хотели бы иметь возможность оперативно отвечать на вопросы сотрудников. Особенно это касается порталов, ориентированных на консультирование сотрудников в онлайновом режиме по вопросам использования программного обеспечения, технических устройств и т.п.</br>Для решения перечисленных задач разработан модуль Техподдержка.",
      link: "https://dev.1c-bitrix.ru/api_help/support/index.php",
      start: true,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "VIP-поддержка 24/7",
      description: "Техническая поддержка от «1С-Битрикс» в режиме 24/7 с минимальным временем реакции от 15 минут. Доступно полное сопровождение проекта от «1С-Битрикс»: вместе с интегратором мы будем работать над проектом и выбирать лучшие технические решения, а также контролировать качество работ по внедрению.",
      link: "#",
      start: false,
      standart: false,
      mb: false,
      b: false,
      ant: true,
    },
    {
      title: "Аудит производительности от 1С-Битрикс",
      description: "",
      link: "#",
      start: false,
      standart: false,
      mb: false,
      b: false,
      ant: true,
    },
    {
      title: "Сопровождение проекта от 1С-Битрикс",
      description: "",
      link: "#",
      start: false,
      standart: false,
      mb: false,
      b: false,
      ant: true,
    },
    //---------------------------------------------------------------------------------------------------------
    //---------------------------------------------------------------------------------------------------------
    {
      title: "SEO-модуль",
      description: "SEO-модуль поможет вам вывести сайт на первые места в поиске. Вам не нужно разбираться в его устройстве: файлы описаний и robots.txt, обновление карты сайта - все операции автоматизированы. Модуль облегчает ежедневную работу по продвижению сайта в рейтингах поисковых машин.",
      link: "https://dev.1c-bitrix.ru/support/forum/forum6/topic34716/",
      start: true,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Социальные сервисы",
      description: "Модуль предоставляет аутентификацию посетителей сайта на внешних сервисах авторизации. Внешняя авторизация облегчает посетителям регистрацию на сайте: не нужно заводить еще один логин/пароль, можно воспользоваться уже имеющимся на одном из известных сервисов.",
      link: "https://dev.1c-bitrix.ru/api_help/socialservices/index.php",
      start: true,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Интеграция с Битрикс24",
      description: "Это приложение позволит вам работать с заказами вашего существующего интернет-магазина на платформе '1С-Битрикс: Управление сайтом' прямо в вашем Битрикс24. Заходите в сделку и управляйте заказами прямо из карточки CRM.",
      link: "https://www.bitrix24.ru/apps/?app=bitrix.eshop",
      start: true,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Веб-формы",
      description: "Данный раздел содержит информацию для веб-разработчиков, использующих модуль Веб-формы для решения задач, выходящих за рамки возможностей стандартных компонентов модуля.</br>Модуль Веб-формы обеспечивает:</br>Наглядный интерфейс создания веб-форм, включающий в себя:</br>-формирование списка вопросов и ответов на них;</br>-формирование списка дополнительных полей;</br>-формирование списка статусов результатов веб-формы;</br>-распределение прав доступа на веб-форму и каждый статус в отдельности.",
      link: "https://dev.1c-bitrix.ru/api_help/form/index.php",
      start: false,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Опросы",
      description: "Информация представленная в данном разделе содержит сведения о функциях модуля Опросы, голосования, необходимых для настройки показа опросов в публичной части сайта, а также об этапах инсталляции модуля.",
      link: "https://dev.1c-bitrix.ru/api_help/form/index.php",
      start: false,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Подписка и рассылки",
      description: "Модуль хранит истории отправленных рассылок, и вы в любой момент можете посмотреть статус успешности отправки. Управление подпиской позволяет создать неограниченное число категорий подписки: новости компании, новинки магазина, новости партнеров и др. Организуйте несколько вариантов подписки:</br>-с обязательной регистрацией пользователя на сайте;</br>-анонимная (без регистрации) с идентификацией только по email-адресу;</br>-подписка на выбор пользователя: анонимно или с регистрацией;</br>-для отправки больших списков получателей реализована пошаговая процедура отправки писем.",
      link: "https://dev.1c-bitrix.ru/api_help/subscribe/index.php",
      start: false,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "A/B тестирование",
      description: "Модуль A/B-тестирование - это инструмент маркетингового исследования, с помощью которого можно сравнить два варианта страницы, шаблона сайта или сайта целиком, чтобы убедиться, какой из вариантов имеет более высокую конверсию и многие другие дополнительные показатели.",
      link: "https://dev.1c-bitrix.ru/learning/course/?COURSE_ID=41&CHAPTER_ID=06747&LESSON_PATH=3911.6747",
      start: false,
      standart: false,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "E-mail маркетинг",
      description: "Модуль Email-маркетинг предназначен для организации работы рассылок.</br>Чем же отличается этот модуль от модуля Рассылки?</br>По сути, их главный функционал одинаков - в обоих случаях мы имеем возможность отправлять рассылки подписчикам.</br>Модуль Email-маркетинг - обновленный полезный инструмент (доступен c версии 15.0.1), принципиально отличающийся от модуля Рассылки автоматикой обновления адресов подписчиков, принципами отправки и отслеживания, а также шаблонизатором и возможностью постоянных отправок с актуальной информацией на основе компонентов для писем.</br>Модуль Рассылки остается для тех, кто его уже применяет (у кого он входил в редакцию на момент покупки).",
      link: "https://dev.1c-bitrix.ru/learning/course/index.php?COURSE_ID=41&CHAPTER_ID=011331",
      start: false,
      standart: false,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Реклама",
      description: "Модуль рекламы позволяет организовать управление баннерами и продажу рекламы на одном или нескольких сайтах, построенных на базе продукта. Размещайте рекламу любых типов, контролируйте показ, настраивайте целевой показ рекламы и многое другое.",
      link: "https://dev.1c-bitrix.ru/api_help/advertising/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Веб-аналитика",
      description: "Модуль Веб-аналитика является для владельца сайта эффективной обратной связью с посетителями и помогает проанализировать готовность структуры и материалов для достижения целей рекламных кампаний. Вы сможете проанализировать поведение посетителей сайта, изучив данные статистики, а затем вернуться в публичный раздел, чтобы внести необходимые изменения в структуру, тексты и ссылки, изменить ключевые моменты текстов, чтобы обратить на них внимание. После этого вы сможете вернуться в модуль статистики и убедиться в эффективности изменений.",
      link: "https://dev.1c-bitrix.ru/learning/course/index.php?COURSE_ID=139&CHAPTER_ID=04544&LESSON_PATH=11427.4544",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    //--------------------------------------------------------------------------------------
    //--------------------------------------------------------------------------------------
    {
      title: "Композитный сайт",
      description: "Пользователи покидают сайт, если загрузка страницы длятся больше 5-7 секунд. Сделать сайт в 100 раз быстрее можно с уникальной технологией «Композитный сайт». Она объединяет высокую скорость загрузки статического сайта и возможности динамических страниц.",
      link: "https://dev.1c-bitrix.ru/support/forum/forum6/topic73819/",
      start: true,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Компрессия",
      description: "Модуль компрессии при передаче данных между сервером и клиентом компрессирует страницы для ускорения вывода содержания сайта пользователям.",
      link: "https://dev.1c-bitrix.ru/support/forum/forum25/topic128902/",
      start: true,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Ежемесячный трафик CDN",
      description: "Модуль «Ускорение сайта (CDN)» - бесплатная дополнительная опция для любой лицензии на «1С-Битрикс: Управление сайтом». Система интегрирована с сетью CDN на уровне платформы.",
      link: "https://dev.1c-bitrix.ru/learning/course/?COURSE_ID=38&LESSON_ID=2353",
      start: "5Гб",
      standart: "10Гб",
      mb: "20Гб",
      b: "40Гб",
      ant: "&#8734;",
    },
    {
      title: "Допустимое число серверов",
      description: "",
      link: "#",
      start: 1,
      standart: 1,
      mb: 1,
      b: 1,
      ant: "от 4",
    },
    {
      title: "Монитор производительности",
      description: "Монитор производительности показывает скорость работы сайта на хостинге, выявляет узкие места (скрипты на сайте, которые потребляют наибольшее число системных ресурсов) и основные ошибки настройки сервера.",
      link: "https://dev.1c-bitrix.ru/api_help/perfmon/index.php",
      start: true,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Визуальное масштабирование",
      description: "Развивайте бизнес без опаски, что сайт не выдержит большого потока клиентов. Система мониторинга заранее подскажет, что ситуация стала критичной, а ваш администратор сможет самостоятельно распределить пиковые нагрузки в удобном визуальном интерфейсе.",
      link: "https://dev.1c-bitrix.ru/learning/course/?COURSE_ID=35&CHAPTER_ID=06644&LESSON_PATH=3906.6663.6644",
      start: false,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Пульс конверсии",
      description: "Задача любого интернет-бизнеса – привести на сайт наибольшее количество покупателей. Инструмент «Пульс конверсии» покажет, какие каналы привлечения клиентов приносят вам максимальную прибыль.",
      link: "https://dev.1c-bitrix.ru/support/forum/forum6/topic72842/",
      start: false,
      standart: false,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Веб-сервисы",
      description: "С помощью модуля можно создавать свои веб-сервисы и клиенты сторонних веб-сервисов.",
      link: "https://dev.1c-bitrix.ru/api_help/webservice/index.php",
      start: false,
      standart: false,
      mb: false,
      b: true,
      ant: true,
    },
    {
      title: "Модуль Веб-кластер",
      description: "Модуль Веб-кластер - это комбинация технологических решений, которые позволяют распределить один сайт на несколько серверов, решая тем самым несколько задач:</br>-обеспечение высокой доступности сайта;</br>-его масштабирование в условиях возрастающей нагрузки;</br>-балансирование нагрузки, трафика, данных между несколькими серверами.",
      link: "https://dev.1c-bitrix.ru/learning/course/index.php?COURSE_ID=35&CHAPTER_ID=04750&LESSON_PATH=3906.6663.4750",
      start: false,
      standart: false,
      mb: false,
      b: false,
      ant: true,
    },
    {
      title: "Балансировка нагрузки между серверами",
      description: "Спектр инструментов, служащих для распределения и балансировки нагрузки между серверами, очень широк. Существуют как дорогие аппаратные решения (например, Cisco CSS, Content Services Switch - различных моделей), так и более простые (но тем не менее весьма эффективные) программные средства.",
      link: "https://dev.1c-bitrix.ru/learning/course/index.php?COURSE_ID=35&LESSON_ID=2990",
      start: false,
      standart: false,
      mb: false,
      b: false,
      ant: true,
    },
    {
      title: "Отказоустойчивость на уровне кластера серверов",
      description: "При переносе бизнеса в интернет каждый час простоя несет в себе потерю заказов и репутации, неэффективность рекламных кампаний и переиндексаций поисковыми роботами, т.е. стоит зачастую немалых денег.</br>Сайт должен работать стабильно, без ошибок и задержек. По результатам исследования компании GoMez, занижение скорости загрузки страниц на 1 секунду снижает конверсию на 7%, а количество просмотров - на 11%.",
      link: "https://efsol.ru/manuals/klaster-1s-setup.html",
      start: false,
      standart: false,
      mb: false,
      b: false,
      ant: true,
    },
    {
      title: "Географически распределенный кластер",
      description: "Можно организовать распределение нагрузки на чтение между slave'ми. Но, так как все веб-сервера читают данные со всех серверов MySQL, то остаются высокие требования к связанности сети, пропускной способности, величине задержки между пакетами. В идеале все сервера должны находиться в одном дата-центре. Однако, если случится авария на уровне целого дата-центра, возникнет проблема. Такое возможно, более того, такое происходило.",
      link: "https://dev.1c-bitrix.ru/learning/course/index.php?COURSE_ID=38&LESSON_ID=3233",
      start: false,
      standart: false,
      mb: false,
      b: false,
      ant: true,
    },
    {
      title: "Автоматическое масштабирование",
      description: "Масштабирование сервера позволяет добиться отказоустойчивой системы в условиях возрастающей нагрузки.",
      link: "https://dev.1c-bitrix.ru/learning/course/?COURSE_ID=35&CHAPTER_ID=06644",
      start: false,
      standart: false,
      mb: false,
      b: false,
      ant: true,
    },
    //--------------------------------------------------------------------
    //--------------------------------------------------------------------
    {
      title: "Облачные хранилища",
      description: "Сделайте работу сайта быстрее, загрузку файлов легче, хранение данных надежнее. Облачное хранилище данных – выгодное решение для любого онлайн-проекта. Подключите облачный сервис к своему ресурсу и легко перемещайте туда все нужные файлы.",
      link: "https://dev.1c-bitrix.ru/api_help/clouds/index.php",
      start: true,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Автоматический бекап в облако",
      description: "Храните резервную копию своего сайта в «облаке» Amazon S3 и делайте это штатными средствами системы. Задайте расписание автоматического резервирования, и не теряйте сайт после различных катаклизмов. Размер выделенного места в облаке зависит от типа лицензии.",
      link: "https://automate.ru/razrabotka-web-saytov/bitriks-upravlenie-saytom/backup.php",
      start: "2Гб",
      standart: "2Гб",
      mb: "4Гб",
      b: "10Гб",
      ant: "&#8734;",
    },
    {
      title: "Маркетплейс",
      description: "Каталог готовых решений! Свыше 2000 готовых решений, от небольших компонентов и модулей до готовых сайтов, интернет-магазинов и информационных систем, разработанных нашими партнерами на платформе 1С-Битрикс.",
      link: "https://whatasoft.net/rus/blog/placement-of-off-the-shelf-solutions-in-the-bitrix-marketplace/",
      start: true,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Базы данных",
      description: "База данных представляет собой независимое клиент-серверное приложение, которое запускается и работает в операционной системе. Внешние приложения соединяются с базой данных через TCP/IP или внутренние потоки, направляют SQL-запросы и получают в ответ от базы данных необходимые данные.",
      link: "https://dev.1c-bitrix.ru/learning/course/index.php?COURSE_ID=32&LESSON_ID=3354",
      start: "MySQL",
      standart: "MySQL",
      mb: "MySQL",
      b: "MySQL",
      ant: "MySQL",
    },
    {
      title: "Проактивная защита",
      description: "Надежная защита вашего сайта от взлома и кражи информации. Вам не нужно беспокоиться о регулярной проверке, просто настройте параметры мониторинга один раз — и система сама будет определять уровень безопасности ресурса и информировать вас в случае появления проблем.",
      link: "https://automate.ru/razrabotka-web-saytov/bitriks-upravlenie-saytom/proactiv.php",
      start: false,
      standart: true,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Мобильное приложение интернет-магазина",
      description: "Приложение «1С-Битрикс: Администрирование» создано для администраторов и менеджеров интернет-магазина. Мобильная «админка» позволяет управлять заказами и получать основные отчеты о работе магазина с мобильных устройств.</br>Как начать пользоваться?</br>Мобильное приложение «1С-Битрикс: Администрирование»</br>-можно скачать в магазинах приложений (App Store и Google Play Market)</br>-настроить на URL своего интернет-магазина</br>-обновить «1С-Битрикс: Управление сайтом» до версии 12.5 и начать управлять своим магазином с мобильного устройства",
      link: "https://dev.1c-bitrix.ru/api_help/workflow/index.php",
      start: false,
      standart: false,
      mb: true,
      b: true,
      ant: true,
    },
    {
      title: "Технология Push & Pull",
      description: "Модуль Push and Pull обеспечивает отправку мгновенных команд.</br>Так как этот функционал организован в виде отдельного модуля, то любой другой модуль (в том числе и модули сторонних разработчиков) может, используя API, отправлять мгновенные нотификации и сообщения клиентам.</br>Работа этого модуля требуется для полной функциональности:</br>Мобильного приложения - задачи, события в календаре, мгновенные сообщения и т.д. обновляются/добавляются мгновенно без обновления страницы.</br>Голосований и опросов - обновление результатов голосования в режиме online.</br>Блогов - мгновенное обновление счетчика лайков у сообщений и комментариев.</br>Веб-мессенджера - мгновенные сообщения в личной и групповой переписке без необходимости ждать опроса сервера, уведомление о том, что сообщение прочитано и пишется ответ, возможность совершать звонки и видеозвонки.",
      link: "https://dev.1c-bitrix.ru/learning/course/?COURSE_ID=99&LESSON_ID=2031&LESSON_PATH=8771.5380.12565.2031",
      start: false,
      standart: false,
      mb: true,
      b: true,
      ant: true,
    }

  ]
};

// let hMod = document.createElement("h2");
// hMod.className = "hMod";
// hMod.textContent = `Модули 1с битрикс`;
// document.body.prepend(hMod);

let html = '<table class="table table-bordered border-primary table-hover table-striped"><thead class="table-dark"><th scope="col">Модули</th><th scope="col">Старт</th><th scope="col">Стандарт</th><th scope="col">Малый бизнес</th><th scope="col">Бизнес</th><th scope="col">Энтерпрайз</th></thead>';
for (let i = 0; i < bit.CMS.length; i++) {
  let pStart = bit.CMS[i].start
  if (pStart === true) {
    pStart = '+'
  } else if (pStart === false) {
    pStart = '-'
  }


  let pStandart = bit.CMS[i].standart
  if (pStandart === true) {
    pStandart = '+'
  }
  if (pStandart === false) {
    pStandart = '-'
  }

  let pMb = bit.CMS[i].mb
  if (pMb === true) {
    pMb = '+'
  }
  if (pMb === false) {
    pMb = '-'
  }

  let pB = bit.CMS[i].b
  if (pB === true) {
    pB = '+'
  }
  if (pB === false) {
    pB = '-'
  }

  let pAnt = bit.CMS[i].ant
  if (pAnt === true) {
    pAnt = '+'
  }
  if (pAnt === false) {
    pAnt = '-'
  }

 html += `
 <div class="modal fade" id="exampleModal`+[i]+`" tabindex="-1" aria-labelledby="exampleModalLabel" aria-hidden="true">
  <div class="modal-dialog">
    <div class="modal-content">
      <div class="modal-header">
        <h5 class="modal-title" id="exampleModalLabel`+[i]+`">` + bit.CMS[i].title + `</h5>
        <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Close"></button>
      </div>
      <div class="modal-body">` + bit.CMS[i].description + `</div>
      <div class="modal-footer">
        <button type="button" class="btn btn-secondary" data-bs-dismiss="modal">Закрыть</button>
       <a href="`+bit.CMS[i].link+`" class="bitLink"><buttontype="button" class="btn btn-primary" data-bs-toggle="modal" data-bs-target="#exampleModal">Подробное описание</button></a>
      </div>
    </div>
  </div>
</div>
    
 `


  html += '<tr>';
  html +=`<td class="box">`+`<a  href="exampleModal`+[i]+`" data-bs-toggle="modal" data-bs-target="#exampleModal`+[i]+`" id="anone`+[i]+`">
  `+bit.CMS[i].title+`
</a></td>`;
  html += '<td>' + pStart + '</td>';
  html += '<td>' + pStandart + '</td>';
  html += '<td>' + pMb + '</td>';
  html += '<td>' + pB + '</td>';
  html += '<td>' + pAnt + '</td>';
  html += '</tr>';
}



window.onload = function () {
  document.getElementById('container').innerHTML = html + '</table>';
};


/*---------------------------------попытка в ботстрап 
 '<td class="box">' + "<button type='button' class='btn btn-primary' data-bs-toggle='modal' data-bs-target='#exampleModal'><a class='button' href='#exampleModal"+[i]+"'>" + bit.CMS[i].title + "</a></button>"+
   "<div id='exampleModal"+[i]+"' class='overlay'><div class='popup'><h2>" 
   + bit.CMS[i].title +
   "</h2><a class='close'href='#'>&times;</a><div class='content'><p>"+
    bit.CMS[i].description +
   "</p><a href='"+ bit.CMS[i].link +"'>Подробное описание</a></div></div></div>" + '</td>';
 ------------------------------------------------------------------*/


/* html += '<td><div class="modal" tabindex="-1"><div class="modal-dialog" id="popup"><div class="modal-content"><div class="modal-header"></div></div></div></div></td>';
 */

/* ----------------------------без бутстрапа-----------------------
html += '<td class="box">' + "<a class='button' href='#popup"+[i]+"'>" + bit.CMS[i].title + "</a>"+ "<div id='popup"+[i]+"' class='overlay'><div class='popup'><h2>" + bit.CMS[i].title + "</h2><a class='close'href='#'>&times;</a><div class='content'><p>"+ bit.CMS[i].description +"</p><a href='"+ bit.CMS[i].link +"'>Подробное описание</a></div></div></div>" + '</td>'; 
--------------------------------------------------------------------*/





/* html += '<td class="box">' + "<a class='button' href='#popup"+[i]+"'>" + bit.CMS[i].title + "</a>"+ "<div id='popup"+[i]+"' class='overlay'><div class='popup'><h2>" + bit.CMS[i].title + "</h2><a class='close'href='#'>&times;</a><div class='content'><p>"+ bit.CMS[i].description +"</p><a href='"+ bit.CMS[i].link +"'>Подробное описание</a></div></div></div>" + '</td>'; */
      //-----------------убрать ссылки
// let titleNumber = bit.CMS[0].title;
// titleNumber.style. = 'red';

//----------------- попытка в вывод заголовков в таблицу
/* let newTh = document.createElement('th')
newTh.innerHTML = '<h2>dasdasd</h2>'
document.querySelector('tbody').prepend(newTh); */

       /*    вывод загаловка */
/* let hMod = document.createElement('h2')
hMod.className = "hMod"
hMod.textContent = `Модули 1с битрикс`
document.body.prepend(hMod) */
//--------------------------------
/* let bitrix = bit.CMS.length;
for (let i = 0; i < bitrix; i++) 
document.write("<a href='" + bit.CMS[i].link + "'>" + bit.CMS[i].title + "</a>" + "<br/>") */

/* --------------------вывод таблицы с плюсами */
/* for (let key in bit.CMS) {
  // if(bit.CMS[key] == true)
  document.write(`
<table class=table>
<td>${bit.CMS[key].start}</td>
<td>${bit.CMS[key].standart}</td>
 <td>${bit.CMS[key].mb}</td>
  <td>${bit.CMS[key].b}</td>
   <td>${bit.CMS[key].ant}</td>
   </table>`);
}  */
      //--------------
 

//           попытка в вывод значений standart true false

      // let item = document.createElement('div')
      // item.className = "and"
      // for (let i = 0; i < bitrix; i++) { 
      // if(bit.CMS[0].start !== false) 
      // item.textContent = `${bit.CMS[i].standart}`
      // document.body.prepend(item)
      // }


    
/* document.querySelector('body').innerHTML = `<table class="bitr"></table>`
for(key in bit.CMS) {
    let row = document.createElement('tr')
    row.innerHTML = `<td>${bit.CMS[0].start}</td>`
    document.querySelector('.bitr').appendChild(row)

        
}
 */




